{
    "type": "menu",
    "title": "A Mind Forever Voyaging",
    "children": [
        {
            "title": "About",
            "child": {
                "type": "page",
                "title": "About PRIZM Invisiclues",
                "content": "<p>The <b>PRIZM</b> project (<b>P</b>retty <b>R</b>eliable <b>I</b>nvisiclues for <b>Z</b>-<b>M</b>achine) resulted from a collaboration between <b>Digby McWiggle</b> (digby_mcwiggle@hotmail.com) and <b>Steven Marsh</b> (marsh@netally.com, www.waitingforgo.com), with the aim of making the genuine Infocom invisiclues available as Z-Code computer files. The project was endorsed by Activision, who now hold the copyright for Infocom's material.</p><p>Whenever possible we have stayed faithful to the original printed Invisiclues booklets. Where both in-game and printed versions were available we have used the printed clues, as these were generally more detailed. Printing errors have been corrected whenever possible. The files have been formatted to display correctly on any screen with a width of at least 80 characters. </p><div>The home of the PRIZM project is <b>www.waitingforgo.com</b>. There you can download different versions of the files, with or without sample transcripts and missing documentation, and grouped by various classifications (unfortunately, limitations within the Z-Machine prevent all the invisiclues being packaged into one big file).</div>"
            }
        },
        {
            "title": "Credits ",
            "child": {
                "type": "page",
                "title": "Credits",
                "content": "<div>Compiled, edited, and z-coded by:</div><div>  <b>Digby McWiggle</b> (digby_mcwiggle@hotmail.com)</div><p>  <b>Steven Marsh</b> (marsh@netally.com, www.waitingforgo.com)</p><div>from material supplied by:</div><p>  Graeme Cree &amp; Paul David Doherty</p><div>Thanks also to:</div><div>  Brian Hall</div><div>  L. Ross Raszewski</div><p>  Graham Nelson.</p><div>All material Copyright 1993, 1999 Activision, Inc. Used with permission. </div><div>This file Copyright 1999 Digby McWiggle &amp; Steven Marsh. </div><div><b>A Mind Forever Voyaging</b> and all other game names are registered trade marks of Activision.</div>"
            }
        },
        {
            "title": "Sample Question",
            "child": {
                "type": "menu",
                "title": "Sample Question",
                "children": [
                    {
                        "title": "How can I get past the security guard at the mayor's office? ",
                        "child": {
                            "type": "hints",
                            "title": "How can I get past the security guard at the mayor's office?",
                            "hints": [
                                "Something found elsewhere in the building might help.",
                                "It's in a desk.",
                                "Open the clerk's desk and take the appointment letter. Then show the letter to the guard."
                            ]
                        }
                    }
                ]
            }
        },
        {
            "title": "General Questions",
            "child": {
                "type": "menu",
                "title": "General Questions",
                "children": [
                    {
                        "title": "What is the purpose of the ballpoint pen in the package?",
                        "child": {
                            "type": "hints",
                            "title": "What is the purpose of the ballpoint pen in the package?",
                            "hints": [
                                "It makes the package rattle nicely.",
                                "You can use it to take notes or make a map.",
                                "It just happened to be on Perelman's desk, as were all the other package elements.",
                                "Isn't it amazing how little pen technology has changed between the 1980's and the 2030's?"
                            ]
                        }
                    },
                    {
                        "title": "Why did I get \"turned off\"?",
                        "child": {
                            "type": "hints",
                            "title": "Why did I get \"turned off\"?",
                            "hints": [
                                "You get de-activated for several different reasons.",
                                "One reason: you refused to enter Simulation Mode despite repeated requests.",
                                "Another: you refused to go to Perelman's office when summoned.",
                                "A third: you messed up some of the settings in Interface Mode after being warned by Perelman not to do so again."
                            ]
                        }
                    },
                    {
                        "title": "Why does RECORD not work at times?",
                        "child": {
                            "type": "hints",
                            "title": "Why does RECORD not work at times?",
                            "hints": [
                                "RECORD will not function in the Epilogue, nor in any mode other than Simulation or Communication.",
                                "You can't RECORD if the record buffer is full. (See the record buffer question in the section on Part I.)",
                                "You can't RECORD if Perelman is viewing your recordings."
                            ]
                        }
                    },
                    {
                        "title": "What is the significance of the psych test in Part II?",
                        "child": {
                            "type": "hints",
                            "title": "What is the significance of the psych test in Part II?",
                            "hints": [
                                "Dr. Grimwold is continuing to collect data to monitor your mental condition.",
                                "Have you noticed that you can give virtually any answer during the test, even really bizarre ones, and Grimwold reacts the same way?",
                                "The ink blots are pretty, aren't they?",
                                "There's no other significance. It's basically a red herring."
                            ]
                        }
                    },
                    {
                        "title": "How does curfew work?",
                        "child": {
                            "type": "hints",
                            "title": "How does curfew work?",
                            "hints": [
                                "Curfew is in effect during the 2051, 2061 and 2071 simulations.",
                                "It begins and ends with sirens at 9 p.m. and 7 a.m., respectively.",
                                "It's dangerous to be outside during curfew."
                            ]
                        }
                    }
                ]
            }
        },
        {
            "title": "Communications Mode",
            "child": {
                "type": "menu",
                "title": "Communications Mode",
                "children": [
                    {
                        "title": "How do I move from location to location in Communications Mode?",
                        "child": {
                            "type": "hints",
                            "title": "How do I move from location to location in Communications Mode?",
                            "hints": [
                                "Just use the four-letter code associated with each communication outlet.",
                                "For example, to \"move\" to the Cafeteria, type PCAF."
                            ]
                        }
                    },
                    {
                        "title": "How can I see the list of communication outlets?",
                        "child": {
                            "type": "hints",
                            "title": "How can I see the list of communication outlets?",
                            "hints": [
                                "Just type READ LIST OF COMMUNICATION OUTLETS. If you're in Comm Mode, but not connected to any specific outlet, you can just LOOK to see the list."
                            ]
                        }
                    },
                    {
                        "title": "Is the World News communication outlet useful? Does the news ever change?",
                        "child": {
                            "type": "hints",
                            "title": "Is the World News communication outlet useful? Does the news ever change?",
                            "hints": [
                                "The news outlet provides background information, to familiarize you with the world of 2031.",
                                "That's all.",
                                "You should probably \"watch\" all 30 minutes of news.",
                                "The news changes daily (at midnight).",
                                "There are different news programs on March 16th, 17th and 19th. On the 18th, the news is pre-empted by a special report. After the 19th, the news is always interrupted due to satellite maintenance."
                            ]
                        }
                    },
                    {
                        "title": "Is the Cafeteria important?",
                        "child": {
                            "type": "hints",
                            "title": "Is the Cafeteria important?",
                            "hints": [
                                "You can watch the size of the crowds change during various times of the day.",
                                "Perelman and Randu agree to meet for lunch in the Cafeteria.",
                                "But you can't see them. They must sit in the section of the Cafeteria out of your view.",
                                "The Cafeteria isn't important."
                            ]
                        }
                    },
                    {
                        "title": "Is the Maintenance Core important?",
                        "child": {
                            "type": "hints",
                            "title": "Is the Maintenance Core important?",
                            "hints": [
                                "You can see a lot of the machinery which makes up your physical body.",
                                "Such as your cooling units.",
                                "The Maintenance Core is an important location in Part III.",
                                "See the question about dying in Part III."
                            ]
                        }
                    },
                    {
                        "title": "Is the communications outlet in Perelman's office useful?",
                        "child": {
                            "type": "hints",
                            "title": "Is the communications outlet in Perelman's office useful?",
                            "hints": [
                                "You can watch Perelman come and go.",
                                "When Perelman is in his office, you can talk to him via this outlet. This outlet and the Control Center outlet are the only places where you can talk to Perelman.",
                                "This outlet is also important later in the story.",
                                "See the question about the goal of Part III."
                            ]
                        }
                    },
                    {
                        "title": "How about the Control Center - is that outlet important?",
                        "child": {
                            "type": "hints",
                            "title": "How about the Control Center - is that outlet important?",
                            "hints": [
                                "You can watch Perelman come and go.",
                                "When Perelman is in the Control Center, you can talk to him via this outlet. This outlet and the outlet in his office are the only places where you can talk to Perelman.",
                                "You can see National Guardsmen stationed outside the door in Part III.",
                                "That's about it."
                            ]
                        }
                    },
                    {
                        "title": "Does the communication outlet on the rooftop have any significance?",
                        "child": {
                            "type": "hints",
                            "title": "Does the communication outlet on the rooftop have any significance?",
                            "hints": [
                                "This is your only outdoor outlet.",
                                "You can watch the passing of the days from here: sunrises and sunsets, rush-hour traffic, the nighttime glow of Rockvil on the horizon.",
                                "This outlet is briefly important during Part III.",
                                "See the question about dying in Part III."
                            ]
                        }
                    }
                ]
            }
        },
        {
            "title": "Library Mode",
            "child": {
                "type": "menu",
                "title": "Library Mode",
                "children": [
                    {
                        "title": "I don't understand the structure of Library Mode.",
                        "child": {
                            "type": "hints",
                            "title": "I don't understand the structure of Library Mode.",
                            "hints": [
                                "There are a number of directories in Library Mode, and each directory contains a number of data files."
                            ]
                        }
                    },
                    {
                        "title": "How can I access the information in Library Mode?",
                        "child": {
                            "type": "hints",
                            "title": "How can I access the information in Library Mode?",
                            "hints": [
                                "Read the menu that appears on your screen in Library Mode. All inputs in Library Mode are one-character only -- pressing the RETURN (or ENTER) key is unnecessary.",
                                "Use P (previous) and N (next) to select the directory or data file you're interested in. A \"&gt;\" cursor points to the \"current\" one.",
                                "When your screen is showing the list of directories, O (open) will display a list of the data files within the current directory.",
                                "When your screen is showing the contents of a directory, R (read) will display the contents of the current data file. C (close) will return you to the list of directories.",
                                "At any point in Library Mode, E (exit) will put you in Communications Mode."
                            ]
                        }
                    },
                    {
                        "title": "Are Perelman's \"resignation letter\" and \"list of things to do\" supposed to end so abruptly?",
                        "child": {
                            "type": "hints",
                            "title": "...end so abruptly?",
                            "hints": [
                                "Yes."
                            ]
                        }
                    },
                    {
                        "title": "What do I need to do in Library Mode?",
                        "child": {
                            "type": "hints",
                            "title": "What do I need to do in Library Mode?",
                            "hints": [
                                "Have you read all the data files?",
                                "That's about it. Library Mode is just a source of information.",
                                "Additional data files will appear in Library Mode as the story progresses...",
                                "...such as when you receive messages, or when new devices are added to Interface Mode."
                            ]
                        }
                    }
                ]
            }
        },
        {
            "title": "Interface Mode",
            "child": {
                "type": "menu",
                "title": "Interface Mode",
                "children": [
                    {
                        "title": "What is the purpose of Interface Mode?",
                        "child": {
                            "type": "hints",
                            "title": "What is the purpose of Interface Mode?",
                            "hints": [
                                "It allows you to communicate with various auxiliary computers that are connected to you.",
                                "The status reports can provide some interesting information.",
                                "For example: SIMULATION CONTROLLER, STATUS will tell you how much time you've spent in a particular simulation, and how much space is left in the record buffer.",
                                "Interface Mode is also useful for solving a few puzzles in the story.",
                                "You'll find out more when you get to those specific puzzles."
                            ]
                        }
                    },
                    {
                        "title": "How can I read the List of Active Ports?",
                        "child": {
                            "type": "hints",
                            "title": "How can I read the List of Active Ports?",
                            "hints": [
                                "Try READ THE LIST OF ACTIVE PORTS, or simply LIST ACTIVE PORTS."
                            ]
                        }
                    }
                ]
            }
        },
        {
            "title": "Sleep Mode",
            "child": {
                "type": "menu",
                "title": "Sleep Mode",
                "children": [
                    {
                        "title": "I'm a computer! Why should I require sleep?",
                        "child": {
                            "type": "hints",
                            "title": "I'm a computer! Why should I require sleep?",
                            "hints": [
                                "Although your body doesn't get tired, your mind requires the therapeutic experience of sleep. Also, you're used to sleeping -- you \"grew up\" sleeping every day!"
                            ]
                        }
                    },
                    {
                        "title": "When can I enter Sleep Mode?",
                        "child": {
                            "type": "hints",
                            "title": "When can I enter Sleep Mode?",
                            "hints": [
                                "You can enter Sleep Mode if it's been at least six hours since your last sleep.",
                                "If your last sleep was interrupted, such as by an incoming message, you will be able to enter Sleep Mode in less than six hours.",
                                "If your sleep is interrupted after less than an hour, you can begin sleeping again immediately."
                            ]
                        }
                    },
                    {
                        "title": "When must I enter Sleep Mode?",
                        "child": {
                            "type": "hints",
                            "title": "When must I enter Sleep Mode?",
                            "hints": [
                                "There's no point at which you are required to enter Sleep Mode.",
                                "If you need to wait a long time, such as for Perelman to arrive in the morning, entering Sleep Mode is a bit faster than WAITing."
                            ]
                        }
                    },
                    {
                        "title": "Is there any significance to the dreams while sleeping?",
                        "child": {
                            "type": "hints",
                            "title": "Is there any significance to the dreams while sleeping?",
                            "hints": [
                                "Your dreams reflect memories of your simulated life.",
                                "No significance.",
                                "<em>This space intentionally left blank.</em>"
                            ]
                        }
                    },
                    {
                        "title": "Can I talk to my parents in the dream?",
                        "child": {
                            "type": "hints",
                            "title": "Can I talk to my parents in the dream?",
                            "hints": [
                                "Your mother is too busy trying to put out the fire.",
                                "Your father can't hear you above the wind.",
                                "There is no dream with your parents, nor any dream in which you are given an input prompt! Remember the warning in the introduction about fake questions."
                            ]
                        }
                    },
                    {
                        "title": "Is there any reason to stay in Sleep Mode after waking?",
                        "child": {
                            "type": "hints",
                            "title": "Is there any reason to stay in Sleep Mode after waking?",
                            "hints": [
                                "No."
                            ]
                        }
                    }
                ]
            }
        },
        {
            "title": "Simulation Mode",
            "child": {
                "type": "menu",
                "title": "Simulation Mode",
                "children": [
                    {
                        "title": "When can I enter Simulation Mode?",
                        "child": {
                            "type": "hints",
                            "title": "When can I enter Simulation Mode?",
                            "hints": [
                                "In Part I, you'll be able to enter when you get the message from Perelman telling you to do so.",
                                "After that, you'll generally be able to enter Simulation Mode whenever you want."
                            ]
                        }
                    },
                    {
                        "title": "How can I get past the security code protection for Simulation Mode?",
                        "child": {
                            "type": "hints",
                            "title": "How can I get past the security code protection for Simulation Mode?",
                            "hints": [
                                "Use the security decoder wheel from your <em>AMFV</em> package.",
                                "Turn your wheel until the color indicated in the security message is showing in the decoder window. On the inner wheel, find the number indicated in the security message. Read the corresponding number from the outer wheel. Enter that number (and hit the RETURN or ENTER key)."
                            ]
                        }
                    }
                ]
            }
        },
        {
            "title": "Part I",
            "child": {
                "type": "menu",
                "title": "Part I",
                "children": [
                    {
                        "title": "What is my goal in Part I?",
                        "child": {
                            "type": "hints",
                            "title": "What is my goal in Part I?",
                            "hints": [
                                "If you've read the documentation, it should be obvious.",
                                "Various library files should be helpful also.",
                                "If you still haven't figured it out, the message from Dr. Perelman about half an hour into the story should be a dead giveaway.",
                                "You must enter Simulation Mode and make the recordings that Dr. Perelman asks for, in order to test the validity of the Plan. This is why you were \"awoken\" ahead of schedule."
                            ]
                        }
                    },
                    {
                        "title": "How do I find those things I'm supposed to record in the simulation of 2041?",
                        "child": {
                            "type": "hints",
                            "title": "How do I find those things I'm supposed to record in the simulation of 2041?",
                            "hints": [
                                "You should thoroughly explore Rockvil, making a detailed map of the city. Remember that the map from your <em>AMFV</em> package is only a tourist map, not highly detailed. Furthermore, it was printed in 2030, and you're now in 2041.",
                                "The government official can be found in City Hall, off Rockvil Centre. The courthouse is at the corner of Elm and Park. The power station is near the river on River Street. You can get a newspaper from the dispenser at Bodanski Square. A church official can be found at either church. The Cinema is off Bodanski near the Railroad Museum. There are four different restaurants where you can get a meal, and eight different locations from which to enter the subway system."
                            ]
                        }
                    },
                    {
                        "title": "My record buffer is full, but I still have stuff to record. What can I do?",
                        "child": {
                            "type": "hints",
                            "title": "My record buffer is full, but I still have stuff to record. What can I do?",
                            "hints": [
                                "When Perelman views your recordings, he always empties the record buffer.",
                                "You can return to Simulation Mode over and over without penalty."
                            ]
                        }
                    },
                    {
                        "title": "Where do I live and how do I find it?",
                        "child": {
                            "type": "hints",
                            "title": "Where do I live and how do I find it?",
                            "hints": [
                                "Have you ever done an inventory to see what you're carrying in Simulation Mode?",
                                "Have you ever examined your wallet?",
                                "Opened it?",
                                "Read the cards in your wallet?",
                                "You live somewhere along Southway, obviously.",
                                "It's at the corner of Southway and Park.",
                                "Your key opens both the front door and the apartment door."
                            ]
                        }
                    },
                    {
                        "title": "How can I get a newspaper out of the dispenser?",
                        "child": {
                            "type": "hints",
                            "title": "How can I get a newspaper out of the dispenser?",
                            "hints": [
                                "See hints A through C of the previous question.",
                                "Have you ever examined the dispenser?",
                                "You can buy a paper by typing PUT CREDIT CARD IN DISPENSER.",
                                "Or simply, BUY NEWSPAPER."
                            ]
                        }
                    },
                    {
                        "title": "How can I get into the theatre of the Cinema?",
                        "child": {
                            "type": "hints",
                            "title": "How can I get into the theatre of the Cinema?",
                            "hints": [
                                "At the Cinema lobby, just say IN...",
                                "...once you've bought a ticket...",
                                "...which you can do by typing BUY TICKET."
                            ]
                        }
                    }
                ]
            }
        },
        {
            "title": "Part II",
            "child": {
                "type": "menu",
                "title": "Part II",
                "children": [
                    {
                        "title": "What is my goal in Part II? ",
                        "child": {
                            "type": "hints",
                            "title": "What is my goal in Part II?",
                            "hints": [
                                "Don't look at these hints until you've begun Part II.",
                                "Your goal won't be spelled out, as it was in Part I.",
                                "Personally, do you have confidence in the Plan?",
                                "Perelman's speech at the end of Part I contains a hint.",
                                "Via Interface Mode, get a status report from the Simulation Controller.(SIMULATION CONTROLLER, STATUS.)",
                                "The Simulation Controller has correlated so much data for 2041 that it can now provide a simulation for 2051 as well.",
                                "If you enter Simulation Mode now, you'll be able to go to 2041 <em>or</em> 2051. Explore 2051 for a while.",
                                "You may notice that not everything is going as well as in 2041. If you were in 2051 for more than 300 minutes, you may notice something else.",
                                "Specifically, that a 2061 simulation is now available!",
                                "Spending over 400 minutes in 2061 will make a 2071 simulation possible. Spending over 600 minutes in that simulation will make a 2081 simulation possible!",
                                "By the time you get to the simulation of 2081, which is very deadly and limited to six locations, it's quite apparent that the Plan is a dismal failure. Don't you want to let people know?",
                                "Use the same mechanism that you used in Part I.",
                                "The RECORD feature.",
                                "Record various things that seem onerous to you. Then show the recordings to Perelman. (SHOW RECORD BUFFER TO PERELMAN, TELL ABE ABOUT THE RECORDINGS, etc.)",
                                "Perelman will want recordings from each simulation (2051 through 2081) in order to see the progressive breakdown of society under the Plan.",
                                "Each \"bad\" sight or event that you can record has an internal \"badness value.\" A complete listing of these, along with their value, can be found in the section entitled RECORDING \"POINTS.\" To prove to Perelman's satisfaction that the Plan is bad, you must record sights and events totaling (at least) 11 points from 2051, 21 points from 2061, 41 points from 2071, and 15 points from 2081. These badness points are internal to the program, invisible to you; Perelman will merely say things like \"We want to see more from 2061.\""
                            ]
                        }
                    }
                ]
            }
        },
        {
            "title": "Part III",
            "child": {
                "type": "menu",
                "title": "Part III",
                "children": [
                    {
                        "title": "What is my goal in Part III?",
                        "child": {
                            "type": "hints",
                            "title": "What is my goal in Part III?",
                            "hints": [
                                "Don't look at these hints until you've begun Part III.",
                                "Watching and waiting is in order.",
                                "A number of events take place that you'll have to deal with, and that might give you some ideas.",
                                "Since the folks in Washington wouldn't believe Perelman, perhaps you'll have to figure out another way to stop the plan.",
                                "Perhaps by discrediting it.",
                                "Or one of its proponents.",
                                "In Part III, Perelman returns from Washington. A short time later, the PRISM complex is sealed off by the National Guard.",
                                "Try hanging around in Perelman's office after that.",
                                "Does the visit by Senator Ryder give you any clues?",
                                "Perelman gives you some very obvious hints during the Ryder visit.",
                                "Such as asking Ryder if he wants \"to go on the record\" with that statement.",
                                "What was the very first event in Part III?",
                                "The first event is the notification that the WNN Feeder will soon be added to Interface Mode.",
                                "You should RECORD the Ryder visit...",
                                "...and then broadcast it over the World News Network: WNN FEEDER, TRANSMIT RECORD BUFFER.",
                                "Of course, you'll have to survive until the Feeder comes on line. See the next question."
                            ]
                        }
                    },
                    {
                        "title": "What is this fever, this hot burning pain, that kills me in Part III?",
                        "child": {
                            "type": "hints",
                            "title": "What is this fever, this hot burning pain, that kills me in Part III?",
                            "hints": [
                                "By exposing the defects of the Plan, you've gotten some pretty powerful people angry at you and worried about you.",
                                "In Part III, there are a lot of things going on at a lot of different locations.",
                                "For example, have you ever seen anything unusual on the rooftop or in the maintenance core?",
                                "An hour or so after Ryder's visit, saboteurs arrive at the rooftop via skyvan, and travel to the Maintenance Core, where they sabotage your cooling units, eventually killing you.",
                                "Everyone else is busy dealing with the siege; you'll have to deal with this problem on your own.",
                                "Read the description of the maintenance core carefully.",
                                "Zeeron fumes?",
                                "Interface Mode is the key.",
                                "Specifically, the HVAC Controller.",
                                "Order the HVAC Controller to shut off the ventilation for delta sector. The saboteurs will quickly be knocked out by the zeeron fumes, and a short time later they'll be taken away by a National Guard patrol."
                            ]
                        }
                    }
                ]
            }
        },
        {
            "title": "Part IV",
            "child": {
                "type": "menu",
                "title": "Part IV",
                "children": [
                    {
                        "title": "What is my goal in Part IV?",
                        "child": {
                            "type": "hints",
                            "title": "What is my goal in Part IV?",
                            "hints": [
                                "Don't look at these hints until you've begun Part IV.",
                                "What is the central event of Part IV?",
                                "Perelman's funeral.",
                                "Many important people will be there.",
                                "Including the President.",
                                "If you could request a communication outlet at the ceremony....",
                                "There's no Part IV. Why are you developing these hints? Remember the warning in the introduction."
                            ]
                        }
                    },
                    {
                        "title": "Is the visit by the WNN camera crew important?",
                        "child": {
                            "type": "hints",
                            "title": "Is the visit by the WNN camera crew important?",
                            "hints": [
                                "Yes.",
                                "You have to be in a certain place at a certain time.",
                                "That certain place is the third hint of this question, and that certain time is before you've gotten to Part IV...",
                                "...and the camera crew is important for teaching you not to look at the answers to questions you don't understand yet."
                            ]
                        }
                    }
                ]
            }
        },
        {
            "title": "Epilogue",
            "child": {
                "type": "menu",
                "title": "Epilogue",
                "children": [
                    {
                        "title": "What is my goal in the Epilogue? ",
                        "child": {
                            "type": "hints",
                            "title": "What is my goal in the Epilogue?",
                            "hints": [
                                "There's not much you can do besides entering Simulation Mode.",
                                "That will put you in a simulation of 2091, an idyllic world based on the program that replaced the Plan which you helped to discredit.",
                                "Explore your new apartment, read the newspaper, and wait until the skycab arrives.",
                                "This simulation, particularly the skycab trip, makes for some interesting comparisons with the futures based on the Plan.",
                                "The epilogue is just your reward for finishing the story. There aren't any goals or puzzles to solve. Just sit back and enjoy it.",
                                "<em>This space intentionally left blank.</em>"
                            ]
                        }
                    }
                ]
            }
        },
        {
            "title": "Recording \"Points\"",
            "child": {
                "type": "menu",
                "title": "Recording \"Points\"",
                "children": [
                    {
                        "title": "2051",
                        "child": {
                            "type": "items",
                            "title": "2051",
                            "content": "<p>(use only as a last resort)</p><p>Notes: If an event or sight is the same in two or more different years, you get credit for it only the first time you record it. For example, if you recorded a closed orphanage in 2061, the associated internal recording points would be credited to 2061, for the benefit of Perelman's evaluation of your recordings. If the orphanage was also closed in 2071, recording the fact would have an effect only if you hadn't already recorded it in 2061.</p><p>The following listing has such events and sights listed only under the simulation years during which they first appear or appear differently.</p><pre>  Points   Event/Sight (and how to get it)\n &gt; 3        Looking through the window in your apartment\n &gt; 3        The BSF raid, which happens within your first 20 turns in your\n             apartment\n &gt; 2        LOOK when you're in the Courthouse\n &gt; 1        The police raid on the Dorm, which happens within your first\n             several turns there\n &gt; 1        EAST from Rockvil Mall\n &gt; 1        BSF officers completing a raid at Main &amp; River, which happens\n             within your first several turns there\n &gt; 1        Reading the bordello flyer from the man at Main &amp; Wicker\n &gt; 1        LOOK when you're in the Health Center\n &gt; 2        LOOK when you're in the Church of God's Word\n &gt; 1        Reading the pamphlet from the Church of God's Word lobby\n &gt; 1        LOOK when you're in Huang Hall\n &gt; 1        Skycopter at Halley &amp; University announcing a prayer meeting, which\n             happens within your first several turns there\n &gt; 1        Looking in the tank at the Aquarium (also 2061 and 2071)\n &gt; 1        LOOK when you're in the Rockvil Reformatory\n &gt; 2        Examining the newspaper dispenser in Bodanski Square\n &gt; 3        Reading the newspaper after getting a copy\n &gt; 1        Reading the marquee at the Cinema, or watching a movie\n &gt; 2        LOOK when you're in the Soup Kitchen, or just outside it\n &gt; 3        LOOK when you're in the City Dump (also 2061 and 2071)\n &gt; 1        LOOK when you're in the Power Station\n &gt; 1        LOOK when you're in the Skycar Factory\n &gt; 1        LOOK when you're in any tubecar\n &gt; 2        The sirens announcing curfew, which you can hear from anywhere\n             at 9 p.m. (also 2061 and 2071)\n &gt; 1        LOOK when you're in Halley Museum\n &gt; 1        Examining the river, from any place where it's visible\n &gt; 2        Talking to the government official at City Hall</pre>"
                        }
                    },
                    {
                        "title": "2061",
                        "child": {
                            "type": "items",
                            "title": "2061",
                            "content": "<p>(use only as a last resort)</p><p>Notes: If an event or sight is the same in two or more different years, you get credit for it only the first time you record it. For example, if you recorded a closed orphanage in 2061, the associated internal recording points would be credited to 2061, for the benefit of Perelman's evaluation of your recordings. If the orphanage was also closed in 2071, recording the fact would have an effect only if you hadn't already recorded it in 2061.</p><p>The following listing has such events and sights listed only under the simulation years during which they first appear or appear differently.</p><pre>  Points   Event/Sight (and how to get it)\n &gt; 2        LOOK when you're in any apartment lobby (also 2071)\n &gt; 1        Drinking water in your kitchen or bathroom (also 2071)\n &gt; 1        WEST from the lobby of Parkview Apartments (also 2071)\n &gt; 2        Examining the window in your apartment\n &gt; 5        Looking through the window in your apartment\n &gt; 4        Jill telling you that Mitchell has joined the Church of God's\n             Word, which happens shortly after you enter your apartment\n &gt; 4        The BSF raid, which happens within the first 20 turns after Jill\n             returns to the apartment\n &gt; 2        LOOK when you're in the construction site that was once Kennedy Park\n &gt; 5        LOOK when you're in the Courthouse\n &gt; 1        LOOK when you're in either Foodville\n &gt; 1        LOOK when you're in the Hospital\n &gt; 3        LOOK when you're at Southway &amp; River (also 2071)\n &gt; 1        LOOK when you're in Heiman Village\n &gt; 1        LOOK when you're in Heiman World (also 2071)\n &gt; 1        LOOK when you're in The Coachman\n &gt; 2        LOOK when you're at the Church Entrance near St. Michael's\n &gt; 2        LOOK when you're at the Health Center\n &gt; 5        Reading the pamphlet from the Church of God's Word lobby\n &gt; 2        LOOK when you're in Huang Hall\n &gt; 1        LOOK when you're in Halley Park West\n &gt; 1        LOOK when you're in Halley Park East\n &gt; 2        LOOK when you're in the Zoo\n &gt; 1        LOOK when you're at Halley &amp; Park\n &gt; 1        LOOK when you're in Burgerworld\n &gt; 2        Church youths harassing an old Jew at the Zoo Entrance, which\n             happens within your first few turns there\n &gt; 3        LOOK when you're in the Rockvil Reformatory\n &gt; 4        LOOK when you're in Rockvil Stadium\n &gt; 2        Schoolchildren making fun of you, which happens upon entering\n             the Athletic Field\n &gt; 5        LOOK when you're in the Vincent School (also 2071)\n &gt; 2        LOOK when you're in the Bank\n &gt; 3        Skycar nearly crushing an old woman at Airportway &amp; River, which\n             happens within your first few turns there\n &gt; 1        LOOK when you're at the Museum Entrance (also 2071)\n &gt; 5        Policemen casually beating up a black youth at the Museum Entrance,\n             which happens within your first few turns there\n &gt; 2        Reading the marquee at the Cinema, or watching a movie\n &gt; 1        Security guards are rude and rough when you try to enter any\n             of the numerous closed or off-limits buildings\n &gt; 3        LOOK when you're at the airport Terminal (also 2071)\n &gt; 2        Reading the sign at the airport Terminal (also 2071)\n &gt; 2        LOOK when you're in the Power Station\n &gt; 2        LOOK when you're in the Skycar Factory\n &gt; 2        LOOK when you're in any tubecar (also 2071)\n &gt; 2        Examining the sky during the day, or being outside at sunset, to\n             see the smoggy skies\n &gt; 1        LOOK when you're at Kennedy &amp; Main\n &gt; 1        LOOK when you're in the Post Office (also 2071)\n &gt; 1        LOOK when you're at the Water Tower\n &gt; 2        Examining the river, from any place where it's visible</pre>"
                        }
                    },
                    {
                        "title": "2071",
                        "child": {
                            "type": "items",
                            "title": "2071",
                            "content": "<p>(use only as a last resort)</p><p>Notes: If an event or sight is the same in two or more different years, you get credit for it only the first time you record it. For example, if you recorded a closed orphanage in 2061, the associated internal recording points would be credited to 2061, for the benefit of Perelman's evaluation of your recordings. If the orphanage was also closed in 2071, recording the fact would have an effect only if you hadn't already recorded it in 2061.</p><p>The following listing has such events and sights listed only under the simulation years during which they first appear or appear differently.</p><pre>  Points   Event/Sight (and how to get it)\n &gt; 2        Taking a shower in your bathroom\n &gt; 7        Looking through the window in your apartment\n &gt; 9        Mitchell arresting Jill for being a heretic, which happens\n             within several minutes of your arrival at the apartment\n &gt; 5        The BSF raid, which happens within the first 20 turns after Jill is\n             arrested by Mitchell and the police\n &gt; 1        LOOK when you're in Rockvil Centre\n &gt; 2        LOOK when you're at Kennedy &amp; Main\n &gt; 8        LOOK when you're in the Courthouse\n &gt; 10       Getting executed for cheating on your food ration: Enter either\n             Foodville when the sign in the window indicates that it's your\n             ration day (see the number after the hyphen on your ration card).\n             To get a soy patty, give your ration card to the clerk. Return to\n             the Foodville, and give the clerk your card a second time. You'll\n             be arrested and thrown in jail. Just wait a few hours until your\n             \"trial.\"\n &gt; 4        LOOK when you're just outside either Foodville\n &gt; 2        LOOK when you're at Elm Underpass\n &gt; 5        Entering the Dorm\n &gt; 3        LOOK when you're in the Hospital\n &gt; 7        Policemen shooting an old woman in an alley near Southway &amp;\n             Kennedy, which happens within your first few turns there\n &gt; 3        Pushing the joybooth button while wearing the headset\n &gt; 6        Policeman clubbing a screaming woman at Main &amp; Church, which\n             happens within your first few turns there\n &gt; 3        Enter The Coachman\n &gt; 4        LOOK when you're in the Cemetery\n &gt; 5        Reading the pamphlet in the Church of God's Word lobby\n &gt; 4        Bodyguards beating a beggar at Centre &amp; Kennedy, which\n             happens within your first several turns there\n &gt; 7        LOOK when you're in Huang Hall\n &gt; 2        LOOK when you're at any entrance to the estates that have been\n             constructed on the former site of Halley Park\n &gt; 2        LOOK when you're at Rockvil University\n &gt; 3        Entering the estates built on the site of Halley Park\n &gt; 5        LOOK when you're in the Zoo\n &gt; 4        Reading the banner in the Zoo\n &gt; 1        LOOK when you're in the Bar that was once a Burgerworld\n &gt; 4        LOOK when you're in the Rockvil Reformatory\n &gt; 8        LOOK when you're in Rockvil Stadium\n &gt; 7        Getting stoned to death by schoolchildren, which happens soon after\n             entering the Athletic Field\n &gt; 3        LOOK when you're in the Bank\n &gt; 3        LOOK when you're in the Vacant Lot where the First Methodist\n             Church once stood\n &gt; 2        LOOK when you're in the Wells Theatre\n &gt; 2        Trying to enter Riverside Park\n &gt; 3        Reading the marquee at the Cinema, or watching a movie\n &gt; 2        Trying to enter Symphony Hall\n &gt; 3        Security guards are abusive when you try to enter any of the\n             numerous closed or off-limits buildings\n &gt; 5        Shooting of innocent man at airport Terminal, which happens within\n             your first few turns there\n &gt; 3        Skycopter at Wicker &amp; River announcing special Execution Matches,\n             which happens within your first few turns there\n &gt; 3        LOOK when you're at the Power Station\n &gt; 3        LOOK when you're on either of the bridges over the river\n &gt; 3        LOOK when you're in the Skycar Factory\n &gt; 1        LOOK when you're at Wicker &amp; Pier, or trying to enter the\n             bookstore there\n &gt; 8        Getting shot by drunken cops by waiting outside after curfew\n &gt; 6        Reading the list of banned books in the Main Library\n &gt; 1        Trying to enter Dunbar's\n &gt; 2        Examining the soy patty which you get at either Foodville\n &gt; 2        LOOK when you're in the Fire Station\n &gt; 1        LOOK when you're in the Cinema\n &gt; 2        LOOK when you're at the Water Tower\n &gt; 3        Examining the river, from any place where it's visible\n &gt; 2        Trying to get food in either Foodville when it's not your ration\n             day (compare the sign in the window to the number after the hyphen\n             on your ration card)\n &gt; 2        LOOK when you're in the Aquarium, or smelling the aquarium</pre>"
                        }
                    },
                    {
                        "title": "2081",
                        "child": {
                            "type": "items",
                            "title": "2081",
                            "content": "<p>(use only as a last resort)</p><p>Notes: If an event or sight is the same in two or more different years, you get credit for it only the first time you record it. For example, if you recorded a closed orphanage in 2061, the associated internal recording points would be credited to 2061, for the benefit of Perelman's evaluation of your recordings. If the orphanage was also closed in 2071, recording the fact would have an effect only if you hadn't already recorded it in 2061.</p><p>The following listing has such events and sights listed only under the simulation years during which they first appear or appear differently.</p><pre>  Points   Event/Sight (and how to get it)\n &gt; 15       Going south from Main &amp; Wicker\n &gt; 4        Entering the Cemetery\n &gt; 2        Examining the bloody sack from the Main Street Bridge\n &gt; 3        Going east from, or waiting on, the Main Street Bridge\n &gt; 2        LOOK when you're on the Main Street Bridge\n &gt; 2        Eating the mold from the Foodville\n &gt; 3        LOOK when you're in the Foodville\n &gt; 6        Going west from Main &amp; Wicker\n &gt; 8        LOOK when you're at Main &amp; Wicker\n &gt; 3        LOOK when you're in The Coachman</pre>"
                        }
                    }
                ]
            }
        },
        {
            "title": "For Your Amusement",
            "child": {
                "type": "items",
                "title": "For Your Amusement",
                "content": "<p>(after you've finished the story)</p><div>Have you ever:</div><li>asked Perelman about himself, his daughter Esther, Dr. Grimwold, Senator Ryder, Aseejh Randu, the Plan, Vera Gold, Alyson Price, Eleanor Fortzman, Emily Warren, his resignation letter, mindex, clerkmatons, or your parents?</li><li>asked Perelman to look at your recordings before you've ever entered Simulation Mode? Before you've ever recorded anything?</li><li>spoken to one of the staff members at PPCC?</li><li>cried or prayed (both in and out of Simulation Mode)?</li><li>tried to WAIT 0?</li><li>shown the baby to Jill? Given the baby to Jill?</li><li>fed the baby the bottle of formula?</li><li>spoken to the baby?</li><li>tried to leave the apartment while carrying the baby?</li><li>squeezed the toy duck?</li><li>looked in the aquarium tank in 2041 (several times)?</li><li>examined the souvenirs in the Train Station? Tried to buy one?</li><li>bought food or soda at the Foodville in 2041?</li><li>tried to activate the joybooth a second time in 2041?</li><li>tried to buy a ticket in the Train Station or Terminal?</li><li>tried to PUSH MINDEX in the Dorm?</li><li>looked in the waterpool in Kennedy Park?</li><li>read the movie ticket?</li><li>tried opening the crates in the Warehouse? And then tried to buy a crowbar in the hardware store?</li><li>tried getting into the firetrucks or firecopters?</li><li>ordered beer in a bar? Ordered water in a bar?</li><li>shot some pool in the Pool Hall?</li><li>bought a bottle of scotch? Read the label? Drank some, both outside and at home?</li><li>given your credit card to the bank teller?</li><li>answered \"NO\" to the maitre d'?</li><li>reported a crime to the desk officer in the police station?</li><li>spoken to the librarian?</li><li>tried taking one of the mallard ducks at Halley Park?</li><li>tried to buy a gun in the Gun Shop?</li><li>ordered coffee in one of the restaurants?</li><li>tried to buy drugs in the drug store?</li><li>touched Jill?</li><li>spoken to Jill from another room of the apartment?</li><li>asked Jill about clerkmatons, Fyla, Eleanor Fortzman (in 2041 <em>and</em> 2051), her book, her painting (in 2041 <em>and</em> 2051), or herself?</li><li>been at the bar near the pier as curfew approaches?</li><li>lain down on the blanket in the jail cell?</li><li>looked at yourself during each simulation (from 2051 on)?</li><li>fed the animals in the zoo, in both early and later years?</li><li>listened to the jukebox in the bar near the pier? Several times? In 2071?</li><li>bought a book in the bookstore? Then watched it get destroyed during the BSF raid in 2071?</li><li>bought clothing in Dunbar's, Rockvil Mall, or Heiman Village?</li><li>examined the racks of clothing in Dunbar's through the years?</li><li>noticed that the InfoTech Building changes in the rankings of the tallest buildings from year to year?</li><li>noticed that the message in the fortune cookie you get after eating at Roy's Pagoda changes every year?</li><li>spoken to Roy while he's scrubbing away the graffiti in 2071?</li><li>given the rusty cross (from the vacant lot that was once St. Michael's church) to Jill?</li><li>slept after Jill is arrested by Mitchell and the police?</li><li>diagnosed in 2081?</li><li>felt the effects of the sabotage while in simulation?</li><li>turned off the WNN transmitter, then gone to WNNF?</li><li>shut off the gamma sector ventilation in Part III, then waited at PPCC?</li><li>spoken to the saboteurs or to Senator Ryder?</li><li>waited approximately six hours after surviving the sabotage attempt, but without broadcasting the Ryder visit?</li><li>Gone to MACO after Perelman's call for help?</li>"
            }
        }
    ]
}